## Basics

In [2]:
print("Hello")
print('Hello')
print("Hello",5)
print("Hello" + str(5))

Hello
Hello
Hello 5
Hello5

In [3]:
2+3

5

In [4]:
a = 5
type(a)

int

In [5]:
a = "hello"
type(a)

str

In [6]:
b = 10.4
type(b)

float

In [7]:
condition = 1
while condition < 10 :
    print(condition)
    condition += 1

1
2
3
4
5
6
7
8
9

In [19]:
for i in range(1,10):
    print(i)

1
2
3
4
5
6
7
8
9

In [8]:
x = 6
if x == 5:
    print(x)
else:
    print("Not x")

Not x

## Function

In [9]:
def example():
    print("this will run")
    z = 3 + 9
    print(z)

In [10]:
example()

this will run
12

In [11]:
def add(num1, num2):
    answer = num1 + num2
    return answer

In [12]:
add(5, 6)

11

## File Operations

In [13]:
text = "Sample text\nNew line!"
savefile = open('examplefile.txt', 'w') # w, r, a
savefile.write(text)
savefile.close()

In [14]:
append = "\nnew info"
appendfile = open('examplefile.txt', 'a')
appendfile.write(append)
appendfile.close()

In [15]:
readme = open('examplefile.txt', 'r')
print(readme.read())
readme.close()

Sample text
New line!
new info

## Collections

### list

In [24]:
x = [1, 2, 4 ,5 , 6, 9, 7, 8, 3]
x

[1, 2, 4, 5, 6, 9, 7, 8, 3]

In [25]:
x.insert(2,55)
x

[1, 2, 55, 4, 5, 6, 9, 7, 8, 3]

In [26]:
x.append(10)
x

[1, 2, 55, 4, 5, 6, 9, 7, 8, 3, 10]

In [27]:
x.remove(6)
x

[1, 2, 55, 4, 5, 9, 7, 8, 3, 10]

In [28]:
x.sort()
x

[1, 2, 3, 4, 5, 7, 8, 9, 10, 55]

In [29]:
x.reverse()
x

[55, 10, 9, 8, 7, 5, 4, 3, 2, 1]

In [30]:
x[2:5]

[9, 8, 7]

### Dictionary

In [31]:
exDict = {'Jack': 15, 'Bob': 21, 'Kevin': 17}

In [32]:
exDict.keys()

dict_keys(['Jack', 'Bob', 'Kevin'])

In [33]:
exDict.values()

dict_values([15, 21, 17])

In [34]:
exDict['Jack']

15

In [35]:
exDict1 = {'Jack': [15, 'black', 'NW']}

In [36]:
exDict1['Jack'][1]

'black'

## Pandas

In [38]:
import pandas as pd

In [37]:
web_stats = {
    'Day' : [1,2,3,4,5],
    'Visitors' : [42,44,45,46,48],
    'Bounce' : [65,57,58,59,80]
}

In [39]:
df = pd.DataFrame(web_stats)
df.head()

   Bounce  Day  Visitors
0      65    1        42
1      57    2        44
2      58    3        45
3      59    4        46
4      80    5        48

In [40]:
employee_df = pd.read_excel('employees.xlsx', sheet_name='Sheet1')
employee_df.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,101,Neena,Kochhar,NKOCHHAR,515.123.4568,1989-09-21,AD_VP,17000,NaN,100,90.0
1,102,Lex,De Haan,LDEHAAN,515.123.4569,1993-01-13,AD_VP,17000,NaN,100,90.0
2,103,Alexander,Hunold,AHUNOLD,590.423.4567,1990-01-03,IT_PROG,9000,NaN,102,60.0
3,104,Bruce,Ernst,BERNST,590.423.4568,1991-05-21,IT_PROG,6000,NaN,103,60.0
4,105,David,Austin,DAUSTIN,590.423.4569,1997-06-25,IT_PROG,4800,NaN,103,60.0

In [41]:
employee_df.columns

Index(['EMPLOYEE_ID', 'FIRST_NAME', 'LAST_NAME', 'EMAIL', 'PHONE_NUMBER',
       'HIRE_DATE', 'JOB_ID', 'SALARY', 'COMMISSION_PCT', 'MANAGER_ID',
       'DEPARTMENT_ID'],
      dtype='object')

In [42]:
employee_df = employee_df.drop("COMMISSION_PCT", axis=1)
employee_df.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,MANAGER_ID,DEPARTMENT_ID
0,101,Neena,Kochhar,NKOCHHAR,515.123.4568,1989-09-21,AD_VP,17000,100,90.0
1,102,Lex,De Haan,LDEHAAN,515.123.4569,1993-01-13,AD_VP,17000,100,90.0
2,103,Alexander,Hunold,AHUNOLD,590.423.4567,1990-01-03,IT_PROG,9000,102,60.0
3,104,Bruce,Ernst,BERNST,590.423.4568,1991-05-21,IT_PROG,6000,103,60.0
4,105,David,Austin,DAUSTIN,590.423.4569,1997-06-25,IT_PROG,4800,103,60.0

In [43]:
employee_df['EMPLOYEE_ID']

0      101
1      102
2      103
3      104
4      105
5      106
6      107
7      108
8      109
9      110
10     111
11     112
12     113
13     114
14     115
15     116
16     117
17     118
18     119
19     120
20     121
21     122
22     123
23     124
24     125
25     126
26     127
27     128
28     129
29     130
      ...
76     177
77     178
78     179
79     180
80     181
81     182
82     183
83     184
84     185
85     186
86     187
87     188
88     189
89     190
90     191
91     192
92     193
93     194
94     195
95     196
96     197
97     198
98     199
99     200
100    201
101    202
102    203
103    204
104    205
105    206
Name: EMPLOYEE_ID, Length: 106, dtype: int64

In [44]:
employee_df[['EMPLOYEE_ID', 'FIRST_NAME']]

     EMPLOYEE_ID   FIRST_NAME
0            101        Neena
1            102          Lex
2            103    Alexander
3            104        Bruce
4            105        David
5            106        Valli
6            107        Diana
7            108        Nancy
8            109       Daniel
9            110         John
10           111       Ismael
11           112  Jose Manuel
12           113         Luis
13           114          Den
14           115    Alexander
15           116       Shelli
16           117        Sigal
17           118          Guy
18           119        Karen
19           120      Matthew
20           121         Adam
21           122        Payam
22           123       Shanta
23           124        Kevin
24           125        Julia
25           126        Irene
26           127        James
27           128       Steven
28           129        Laura
29           130        Mozhe
..           ...          ...
76           177         Jack
77           178    Kimberely
78           179      Charles
79           180      Winston
80           181         Jean
81           182       Martha
82           183       Girard
83           184      Nandita
84           185       Alexis
85           186        Julia
86           187      Anthony
87           188        Kelly
88           189     Jennifer
89           190      Timothy
90           191      Randall
91           192        Sarah
92           193      Britney
93           194       Samuel
94           195        Vance
95           196        Alana
96           197        Kevin
97           198       Donald
98           199      Douglas
99           200     Jennifer
100          201      Michael
101          202          Pat
102          203        Susan
103          204      Hermann
104          205      Shelley
105          206      William

[106 rows x 2 columns]

In [45]:
employee_df.to_csv('emp.csv', index=False)

## panda from db

In [47]:
import dbms
import pandas as pd

In [48]:
user = "scott"
password = "tiger"
service_name = "orcl"
host = "10.188.193.152"
port = "1521"

In [49]:
con = dbms.connect.oracle(user, password, service_name, host, port)
cs = con.cursor()

In [50]:
cs.execute("select * from EMPLOYEES")

columns = [x[0] for x in cs.description]

pdf = pd.DataFrame(cs.fetchall(), columns=columns)

In [51]:
pdf.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,207,TEK,FCS,something@text.com,12345,2013-03-12 00:00:00,123,12345,0.01,123,123
1,100,Steven,King,SKING,515.123.4567,1987-06-17 00:00:00,AD_PRES,24000,None,None,90
2,101,Neena,Kochhar,NKOCHHAR,515.123.4568,1989-09-21 00:00:00,AD_VP,17000,None,100,90
3,102,Lex,De Haan,LDEHAAN,515.123.4569,1993-01-13 00:00:00,AD_VP,17000,None,100,90
4,103,TEK,FCS,AHUNOLD,590.423.4567,1990-01-03 00:00:00,IT_PROG,9000,None,102,60

## numpy